app/controllers/todos_controller.rb

  def show
    @todo = Todo.find(params[:id])
---
SELECT * FROM "todos" WHERE ("todos"."id" = 1)

  def create
    @todo = Todo.new(params[:todo])

    respond_to do |format|
      if @todo.save
---
INSERT INTO "todos" ("updated_at", "prazo", "descricao", "feito", "created_at") VALUES('2009-02-17 21:32:30', NULL, 'Curabitur lacinia feugiat nisl. Curabitur sit amet nulla. Aliquam erat volutpat. Praesent tellus tortor, fringilla quis, egestas non; tempor et, nisl. Curabitur quam felis, tempor a, facilisis ut, rutrum ultrices, risus. Cum sociis natoque penatibus et magnis dis parturient montes, nascetur ridiculus mus. Integer dignissim, velit et vulputate elementum, odio arcu ornare lorem, id cursus enim tortor vel augue. Vivamus imperdiet? Suspendisse potenti. Quisque vitae magna in libero tempor imperdiet. Curabitur accumsan tellus. Quisque vestibulum massa ac nibh. Donec convallis, mauris sed placerat bibendum, augue elit ultrices magna, at rutrum elit sapien at nunc. Pellentesque in risus id leo tincidunt dapibus. Suspendisse nunc! Morbi fermentum euismod enim. Praesent venenatis? Nam et nisi amet.

  def destroy
    @todo = Todo.find(params[:id])
    @todo.destroy
---
SELECT * FROM "todos" WHERE ("todos"."id" = 1)
DELETE FROM "todos" WHERE "id" = 1